Autodesk.Revit.DB.NamingUtils.CompareNames(System.String,System.String)
Compares two object name strings using Revit's comparison rules.
Remarks:
This routine is similar to System.String.Compare(), but uses Revit rules for comparison. This involves
breaking the names into alphabetic and numeric tokens and comparing tokens individually. Neither comparand is
allowed to be null.
Note that this routine does consider case in comparing names. Some Revit element types disallow assignment
of names where the only difference with existing names is the case of one or more characters, while other
element types do not have this restriction. This routine does not take the particular element type into
account, so it may not identify all "duplicates" if the names are to be used for some element types.
Attempting to set the name on the target Element should provide the final indication of whether it is valid.
nameA:
The first object name to compare.
nameB:
The second object name to compare.
Returns:
An integer indicating the result of the lexical comparison between the two names.
Less than zero if nameA comes before nameB in the ordering, zero if nameA and nameB are equivalent,
and greater than zero if nameA is comes after nameB in the ordering.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.NamingUtils.IsValidName(System.String)
Identifies if the input string is valid for use as an object name in Revit.
Remarks:
This routine checks only for prohibited characters in the string.
When setting the name for an object there are other specific considerations which are checked
(for example, the same name cannot be used twice for different elements of the same type).
This routine does not check those conditions.
string:
The name to validate.
Returns:
True if the name is valid for use as a name in Revit, false if it contains prohibited characters and is invalid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.NamingUtils
A collection of utilities related to element naming.
Since:
2015